In [2]:
import pandas as pd
import numpy as np

In [8]:
#creating list,dict,array 
list1= [1,2,3,4,5,6]
dict1={"Name":"saivenkat","Age":24,"Designation":"Datascientist"}
array=np.array([1,2,3,4,5])
tuple1=(1,2,3,4,5,6)
set1={1,2,3,4,4,5,5,6,6,6,7,8}

In [10]:
print(list1)

[1, 2, 3, 4, 5, 6]

In [11]:
print(dict1)

{'Name': 'saivenkat', 'Age': 24, 'Designation': 'Datascientist'}

In [12]:
print(array)

[1 2 3 4 5]

In [13]:
print(tuple1)

(1, 2, 3, 4, 5, 6)

In [14]:
print(set1)

{1, 2, 3, 4, 5, 6, 7, 8}

In [15]:
pd.Series(list1)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [16]:
pd.Series(dict1)

Name               saivenkat
Age                       24
Designation    Datascientist
dtype: object

In [17]:
pd.Series(array)

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [19]:
pd.Series(tuple1)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [20]:
pd.Series(set1)

TypeError: 'set' type is unordered

In [21]:
pd.Series(list1) #system defined labels

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [22]:
pd.Series(list1,['a','b','c','d','e','f']) #creating my own index values

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [77]:
series1=pd.Series(data= (1,2,3,4,5,6), index = ["sai","I","Love","you","be","happy"]) #creating a series with index values

In [92]:
print(series1)

sai      1
I        2
Love     3
you      4
be       5
happy    6
dtype: int64

In [93]:
series2=pd.Series([4,5,6,7,8,9],["sai","I","Hate","you","be","sad"])

In [94]:
series2

sai     4
I       5
Hate    6
you     7
be      8
sad     9
dtype: int64

In [95]:
series1["sai"]

1

In [96]:
series2["I"]

5

In [98]:
series1["I"]+series2["I"]

7

In [100]:
series1["I"]+series2["Hate"]

8

In [101]:
series1[1]

2

# operations based on index

In [102]:
series1

sai      1
I        2
Love     3
you      4
be       5
happy    6
dtype: int64

In [103]:
series2

sai     4
I       5
Hate    6
you     7
be      8
sad     9
dtype: int64

In [105]:
series1+series2

Hate      NaN
I         7.0
Love      NaN
be       13.0
happy     NaN
sad       NaN
sai       5.0
you      11.0
dtype: float64

# Data frame

In [109]:
from numpy import random

In [147]:
df = pd.DataFrame(random.randn(5,4),index = 'A B C D E'.split(), columns = ['V','W','X','Y'])

In [148]:
df

          V         W         X         Y
A  0.858892 -0.143352 -0.807479 -2.202130
B -0.237295 -1.125972  0.230491 -0.989700
C -0.349643  0.252136 -0.567325 -0.182755
D -1.721672  0.480593 -0.070532  1.786381
E  0.082062  1.343893 -0.361455 -0.951130

# Selection and indexing

In [149]:
df['V']

A    0.858892
B   -0.237295
C   -0.349643
D   -1.721672
E    0.082062
Name: V, dtype: float64

In [150]:
df['W']

A   -0.143352
B   -1.125972
C    0.252136
D    0.480593
E    1.343893
Name: W, dtype: float64

In [152]:
df[["V","X"]]

          V         X
A  0.858892 -0.807479
B -0.237295  0.230491
C -0.349643 -0.567325
D -1.721672 -0.070532
E  0.082062 -0.361455

In [153]:
df.V

A    0.858892
B   -0.237295
C   -0.349643
D   -1.721672
E    0.082062
Name: V, dtype: float64

In [155]:
type(df.V) #type

pandas.core.series.Series

In [156]:
type(df[["V","X"]])

pandas.core.frame.DataFrame

In [160]:
df['new']= df['V'] + df ['X']

In [161]:
df

          V         W         X         Y       new
A  0.858892 -0.143352 -0.807479 -2.202130  0.051413
B -0.237295 -1.125972  0.230491 -0.989700 -0.006804
C -0.349643  0.252136 -0.567325 -0.182755 -0.916967
D -1.721672  0.480593 -0.070532  1.786381 -1.792204
E  0.082062  1.343893 -0.361455 -0.951130 -0.279392

In [163]:
df.drop('new',axis=1)

          V         W         X         Y
A  0.858892 -0.143352 -0.807479 -2.202130
B -0.237295 -1.125972  0.230491 -0.989700
C -0.349643  0.252136 -0.567325 -0.182755
D -1.721672  0.480593 -0.070532  1.786381
E  0.082062  1.343893 -0.361455 -0.951130

In [164]:
df

          V         W         X         Y       new
A  0.858892 -0.143352 -0.807479 -2.202130  0.051413
B -0.237295 -1.125972  0.230491 -0.989700 -0.006804
C -0.349643  0.252136 -0.567325 -0.182755 -0.916967
D -1.721672  0.480593 -0.070532  1.786381 -1.792204
E  0.082062  1.343893 -0.361455 -0.951130 -0.279392

In [170]:
df.drop('new',axis=1,inplace=True)  # the data column will be deleted permanently from dataframe
df

          V         W         X         Y
A  0.858892 -0.143352 -0.807479 -2.202130
B -0.237295 -1.125972  0.230491 -0.989700
C -0.349643  0.252136 -0.567325 -0.182755
D -1.721672  0.480593 -0.070532  1.786381
E  0.082062  1.343893 -0.361455 -0.951130

In [171]:
df.drop(['C','D'],axis=0)

          V         W         X        Y
A  0.858892 -0.143352 -0.807479 -2.20213
B -0.237295 -1.125972  0.230491 -0.98970
E  0.082062  1.343893 -0.361455 -0.95113

In [172]:
df

          V         W         X         Y
A  0.858892 -0.143352 -0.807479 -2.202130
B -0.237295 -1.125972  0.230491 -0.989700
C -0.349643  0.252136 -0.567325 -0.182755
D -1.721672  0.480593 -0.070532  1.786381
E  0.082062  1.343893 -0.361455 -0.951130

In [173]:
df.drop(['D','E'],axis=0,inplace=True)

In [174]:
df

          V         W         X         Y
A  0.858892 -0.143352 -0.807479 -2.202130
B -0.237295 -1.125972  0.230491 -0.989700
C -0.349643  0.252136 -0.567325 -0.182755

# Selecting rows using loc and iloc

In [177]:
df['V'] # if we give like this we will access column value not row value.

A    0.858892
B   -0.237295
C   -0.349643
Name: V, dtype: float64

In [178]:
df.loc['A'] #row value A

V    0.858892
W   -0.143352
X   -0.807479
Y   -2.202130
Name: A, dtype: float64

In [179]:
df.iloc[0] #row value by using standard index value

V    0.858892
W   -0.143352
X   -0.807479
Y   -2.202130
Name: A, dtype: float64

In [181]:
df.loc[['A','B']] #row values

          V         W         X        Y
A  0.858892 -0.143352 -0.807479 -2.20213
B -0.237295 -1.125972  0.230491 -0.98970

In [182]:
df.loc['A','W'] #accessing row with respect to column value

-0.14335233003153341

In [184]:
df.loc['A']['W'] #accesing row with respect to column value

-0.14335233003153341

In [185]:
df.iloc[0,1]

-0.14335233003153341

In [191]:
df.iloc[0][1]

-0.14335233003153341

In [194]:
df.loc[['A','B'],['V','W']]

          V         W
A  0.858892 -0.143352
B -0.237295 -1.125972

In [196]:
df

          V         W         X         Y
A  0.858892 -0.143352 -0.807479 -2.202130
B -0.237295 -1.125972  0.230491 -0.989700
C -0.349643  0.252136 -0.567325 -0.182755

In [197]:
df>0

       V      W      X      Y
A   True  False  False  False
B  False  False   True  False
C  False   True  False  False

In [198]:
df[df>0]

          V         W         X   Y
A  0.858892       NaN       NaN NaN
B       NaN       NaN  0.230491 NaN
C       NaN  0.252136       NaN NaN

In [200]:
df[df['V']>0]

          V         W         X        Y
A  0.858892 -0.143352 -0.807479 -2.20213

In [207]:
df[df['V']>0]['W']

A   -0.143352
Name: W, dtype: float64

In [208]:
df[df['V']>0][['W','X']]

          W         X
A -0.143352 -0.807479

In [209]:
df.reset_index()

  index         V         W         X         Y
0     A  0.858892 -0.143352 -0.807479 -2.202130
1     B -0.237295 -1.125972  0.230491 -0.989700
2     C -0.349643  0.252136 -0.567325 -0.182755

In [217]:
df.columns

Index(['level_0', 'index', 'V', 'W', 'X', 'Y'], dtype='object')

In [218]:
df

   level_0 index         V         W         X         Y
0        0     A  0.858892 -0.143352 -0.807479 -2.202130
1        1     B -0.237295 -1.125972  0.230491 -0.989700
2        2     C -0.349643  0.252136 -0.567325 -0.182755

In [221]:
df.columns

Index(['level_0', 'index', 'V', 'W', 'X', 'Y'], dtype='object')

In [222]:
df.drop('level_0',axis=1,inplace=True)

In [223]:
df

  index         V         W         X         Y
0     A  0.858892 -0.143352 -0.807479 -2.202130
1     B -0.237295 -1.125972  0.230491 -0.989700
2     C -0.349643  0.252136 -0.567325 -0.182755

In [224]:
df.drop('index',axis=1,inplace=True)

In [225]:
df

          V         W         X         Y
0  0.858892 -0.143352 -0.807479 -2.202130
1 -0.237295 -1.125972  0.230491 -0.989700
2 -0.349643  0.252136 -0.567325 -0.182755

In [251]:
'YD SEC NAL'.split()

['YD', 'SEC', 'NAL']

In [250]:
cities='YD SEC NAL'.split()
cities

['YD', 'SEC', 'NAL']

In [253]:
df['cities']=cities

In [254]:
df

          V         W         X         Y cities
0  0.858892 -0.143352 -0.807479 -2.202130     YD
1 -0.237295 -1.125972  0.230491 -0.989700    SEC
2 -0.349643  0.252136 -0.567325 -0.182755    NAL

In [255]:
df.columns

Index(['V', 'W', 'X', 'Y', 'cities'], dtype='object')

In [256]:
df.set_index('cities')

               V         W         X         Y
cities
YD      0.858892 -0.143352 -0.807479 -2.202130
SEC    -0.237295 -1.125972  0.230491 -0.989700
NAL    -0.349643  0.252136 -0.567325 -0.182755

In [257]:
df

          V         W         X         Y cities
0  0.858892 -0.143352 -0.807479 -2.202130     YD
1 -0.237295 -1.125972  0.230491 -0.989700    SEC
2 -0.349643  0.252136 -0.567325 -0.182755    NAL

In [259]:
df.set_index('cities',inplace=True)

In [260]:
df

               V         W         X         Y
cities
YD      0.858892 -0.143352 -0.807479 -2.202130
SEC    -0.237295 -1.125972  0.230491 -0.989700
NAL    -0.349643  0.252136 -0.567325 -0.182755

In [261]:
df.columns

Index(['V', 'W', 'X', 'Y'], dtype='object')

# Multiindex

In [273]:
outside=['A1','A1','A1','B1','B1','B3']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index

[('A1', 1), ('A1', 2), ('A1', 3), ('B1', 1), ('B1', 2), ('B3', 3)]

In [275]:
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('A1', 1),
            ('A1', 2),
            ('A1', 3),
            ('B1', 1),
            ('B1', 2),
            ('B3', 3)],
           )

In [276]:
df=pd.DataFrame(random.randn(6,2),index=hier_index,columns= 'A B'.split())
df

             A         B
A1 1 -0.589445 -1.038132
   2 -0.318430 -1.978329
   3  0.930177  0.493795
B1 1 -0.134405  0.434825
   2  1.260113 -0.464383
B3 3 -0.083825  0.222867

In [277]:
df['A']

A1  1   -0.589445
    2   -0.318430
    3    0.930177
B1  1   -0.134405
    2    1.260113
B3  3   -0.083825
Name: A, dtype: float64

In [279]:
df.loc['A1']

          A         B
1 -0.589445 -1.038132
2 -0.318430 -1.978329
3  0.930177  0.493795

In [281]:
df.loc['B1'].loc[2]

A    1.260113
B   -0.464383
Name: 2, dtype: float64

In [283]:
df.index.names=['Outer','inner']

In [284]:
df

                    A         B
Outer inner
A1    1     -0.589445 -1.038132
      2     -0.318430 -1.978329
      3      0.930177  0.493795
B1    1     -0.134405  0.434825
      2      1.260113 -0.464383
B3    3     -0.083825  0.222867

In [285]:
df.xs('A1')

              A         B
inner
1     -0.589445 -1.038132
2     -0.318430 -1.978329
3      0.930177  0.493795

In [287]:
df.xs("B1")

              A         B
inner
1     -0.134405  0.434825
2      1.260113 -0.464383